In [41]:
import pandas as pd
import re
from datetime import datetime

In [35]:
path = "G:/.shortcut-targets-by-id/1sZS2kL5L66960IYJ4xfNEV9CuKrs_7fE/1조/RAW DATA/"
df = pd.read_excel(path+"가격정보_2000_상품.xlsx")
df.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 286,Unnamed: 287,Unnamed: 288,Unnamed: 289,Unnamed: 290,Unnamed: 291,Unnamed: 292,Unnamed: 293,Unnamed: 294,Unnamed: 295
0,구분,NaN,2022-01-03 00:00:00,2022-01-04 00:00:00,2022-01-05 00:00:00,2022-01-06 00:00:00,2022-01-07 00:00:00,2022-01-08 00:00:00,2022-01-10 00:00:00,2022-01-11 00:00:00,...,2022-12-19 00:00:00,2022-12-20 00:00:00,2022-12-21 00:00:00,2022-12-22 00:00:00,2022-12-23 00:00:00,2022-12-26 00:00:00,2022-12-27 00:00:00,2022-12-28 00:00:00,2022-12-29 00:00:00,2022-12-30 00:00:00
1,평균,NaN,6040,6040,6060,6140,6100,6200,6220,6140,...,2080,2040,2040,2060,2120,2060,2060,2060,2080,2080
2,평년,NaN,2462,2489,2903,2923,2946,2964,2953,2937,...,3014,3002,3000,3001,2999,2958,2939,2926,2906,2784
3,서울,봄,-,-,-,-,-,-,-,-,...,-,-,-,-,-,-,-,-,-,-
4,NaN,여름(고랭지),-,-,-,-,-,-,-,-,...,-,-,-,-,-,-,-,-,-,-

In [36]:
df = df.drop(columns=df.columns[1])
df.drop(index=df.index[3:],inplace=True)
# df

In [37]:
df =df.T

In [38]:
df.rename(columns=df.iloc[0],inplace=True)
# df

In [39]:
df.drop(index=df.index[0],inplace=True)
# df

In [40]:
df["구분"] = df["구분"].apply(lambda x : re.sub(r"2022", "2000", str(x)))

In [44]:
df

                               구분    평균    평년
Unnamed: 2    2000-01-03 00:00:00  6040  2462
Unnamed: 3    2000-01-04 00:00:00  6040  2489
Unnamed: 4    2000-01-05 00:00:00  6060  2903
Unnamed: 5    2000-01-06 00:00:00  6140  2923
Unnamed: 6    2000-01-07 00:00:00  6100  2946
...                           ...   ...   ...
Unnamed: 291  2000-12-26 00:00:00  2060  2958
Unnamed: 292  2000-12-27 00:00:00  2060  2939
Unnamed: 293  2000-12-28 00:00:00  2060  2926
Unnamed: 294  2000-12-29 00:00:00  2080  2906
Unnamed: 295  2000-12-30 00:00:00  2080  2784

[294 rows x 3 columns]

In [46]:
df["구분"] = df["구분"].apply(lambda x : datetime.strptime(x, "%Y-%m-%d %H:%M:%S"))
df

                     구분    평균    평년
Unnamed: 2   2000-01-03  6040  2462
Unnamed: 3   2000-01-04  6040  2489
Unnamed: 4   2000-01-05  6060  2903
Unnamed: 5   2000-01-06  6140  2923
Unnamed: 6   2000-01-07  6100  2946
...                 ...   ...   ...
Unnamed: 291 2000-12-26  2060  2958
Unnamed: 292 2000-12-27  2060  2939
Unnamed: 293 2000-12-28  2060  2926
Unnamed: 294 2000-12-29  2080  2906
Unnamed: 295 2000-12-30  2080  2784

[294 rows x 3 columns]

In [47]:
df.set_index("구분", inplace=True)
df

              평균    평년
구분
2000-01-03  6040  2462
2000-01-04  6040  2489
2000-01-05  6060  2903
2000-01-06  6140  2923
2000-01-07  6100  2946
...          ...   ...
2000-12-26  2060  2958
2000-12-27  2060  2939
2000-12-28  2060  2926
2000-12-29  2080  2906
2000-12-30  2080  2784

[294 rows x 2 columns]

In [52]:
for i in range(2000, 2023) : 
    globals()["df_price_"+str(i)] = pd.read_excel(path+"가격정보_"+str(i)+"_상품.xlsx")
    globals()["df_price_"+str(i)].drop(columns=globals()["df_price_"+str(i)].columns[1],inplace=True)
    globals()["df_price_"+str(i)].drop(index=globals()["df_price_"+str(i)].index[3:],inplace=True)
    globals()["df_price_"+str(i)] = globals()["df_price_"+str(i)].T
    globals()["df_price_"+str(i)].rename(columns= globals()["df_price_"+str(i)].iloc[0],inplace=True)
    globals()["df_price_"+str(i)].drop(index=globals()["df_price_"+str(i)].index[0],inplace=True)
    globals()["df_price_"+str(i)]["구분"] = globals()["df_price_"+str(i)]["구분"].apply(lambda x : re.sub(r"2022", str(i), str(x)))
    globals()["df_price_"+str(i)]["구분"] = globals()["df_price_"+str(i)]["구분"].apply(lambda x : datetime.strptime(x, "%Y-%m-%d %H:%M:%S"))
    globals()["df_price_"+str(i)].set_index("구분", inplace=True)

In [49]:
year_list = []
for i in range(2000, 2023) : 
    y = "df_price_" + str(i)
    year_list.append(y)

year_list

['df_price_2000',
 'df_price_2001',
 'df_price_2002',
 'df_price_2003',
 'df_price_2004',
 'df_price_2005',
 'df_price_2006',
 'df_price_2007',
 'df_price_2008',
 'df_price_2009',
 'df_price_2010',
 'df_price_2011',
 'df_price_2012',
 'df_price_2013',
 'df_price_2014',
 'df_price_2015',
 'df_price_2016',
 'df_price_2017',
 'df_price_2018',
 'df_price_2019',
 'df_price_2020',
 'df_price_2021',
 'df_price_2022']

In [53]:
price_baechoo = pd.concat(
    [df_price_2000,
 df_price_2001,
 df_price_2002,
 df_price_2003,
 df_price_2004,
 df_price_2005,
 df_price_2006,
 df_price_2007,
 df_price_2008,
 df_price_2009,
 df_price_2010,
 df_price_2011,
 df_price_2012,
 df_price_2013,
 df_price_2014,
 df_price_2015,
 df_price_2016,
 df_price_2017,
 df_price_2018,
 df_price_2019,
 df_price_2020,
 df_price_2021,
 df_price_2022], 
 axis=0
)

In [54]:
price_baechoo

              평균    평년
구분
2000-01-03  6040  2462
2000-01-04  6040  2489
2000-01-05  6060  2903
2000-01-06  6140  2923
2000-01-07  6100  2946
...          ...   ...
2022-12-14  6118  7237
2022-12-15  6118  7223
2022-12-16  5991  6983
2022-12-19  6147  7023
2022-12-20  6479  6972

[5895 rows x 2 columns]